Documents/РаспределениеПоУровнямСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РаспределениеПоУровнямСделок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Уровни</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКРаспределению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Уровни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньЦенаПокупки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньКоличествоПокупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньЦенаПродажи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньКоличествоПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПокупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Уровни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Уровни</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаПокупки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Уровни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АктивностьУровня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РаспределениеПоУровнямСделок/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьТаблицуРаспределение(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.БрокерскийСчет) Тогда
		Сообщить( НСтр("ru= 'Необходимо заполнить поле ""Брокерский счет""'"));
		Возврат;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Акция) Тогда
			Сообщить( НСтр("ru= 'Необходимо заполнить поле ""Акция""'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Объект.Распределение.Очистить();
	МассивСтрок = ВыбратьДействующиеУровниИзРегистра(); 
	Для каждого Строки Из МассивСтрок Цикл 
		СтрокаРаспределения = Объект.Распределение.Добавить(); 
		СтрокаРаспределения.Уровень = Строки.Уровень;
		СтрокаРаспределения.УровеньЦенаПокупки = Строки.УровеньЦенаПокупки;
		СтрокаРаспределения.УровеньКоличествоПокупки = Строки.УровеньКоличествоПокупки;
		СтрокаРаспределения.УровеньЦенаПродажи = Строки.УровеньЦенаПродажи;
		СтрокаРаспределения.УровеньКоличествоПродажи = Строки.УровеньКоличествоПродажи; 
	КонецЦикла;
	

	
КонецПроцедуры

&НаСервере
Функция ВыбратьДействующиеУровниИзРегистра()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Уровни.БрокерскийСчет КАК БрокерскийСчет,
	               |	Уровни.Акция КАК Акция,
	               |	Уровни.Уровень КАК Уровень,
	               |	Уровни.АктивностьУровня КАК АктивностьУровня,
	               |	Уровни.Уровень.ЦенаПокупки КАК УровеньЦенаПокупки,
	               |	Уровни.Уровень.КоличествоПокупки КАК УровеньКоличествоПокупки,
	               |	Уровни.Уровень.ЦенаПродажи КАК УровеньЦенаПродажи,
	               |	Уровни.Уровень.КоличествоПродажи КАК УровеньКоличествоПродажи
	               |ИЗ
	               |	РегистрСведений.Уровни КАК Уровни
	               |ГДЕ
	               |	Уровни.БрокерскийСчет = &БрокерскийСчет
	               |	И Уровни.Акция = &Акция
	               |	И Уровни.АктивностьУровня = &АктивностьУровня
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Уровни.Уровень.ЦенаПокупки УБЫВ";
	Запрос.Параметры.Вставить("БрокерскийСчет", Объект.БрокерскийСчет);
	Запрос.Параметры.Вставить("Акция",Объект.Акция);
	Запрос.Параметры.Вставить("АктивностьУровня", Ложь);
	Выборка = Запрос.Выполнить();
	РезультатЗапроса = Выборка.Выбрать();
	МассивСтрок = Новый Массив;
	Пока РезультатЗапроса.Следующий() Цикл   
		ОписаниеУровня = Новый Структура();
		ОписаниеУровня.Вставить("Уровень", РезультатЗапроса.Уровень); 
		ОписаниеУровня.Вставить("УровеньЦенаПокупки", РезультатЗапроса.УровеньЦенаПокупки);
		ОписаниеУровня.Вставить("УровеньКоличествоПокупки", РезультатЗапроса.УровеньКоличествоПокупки);
		ОписаниеУровня.Вставить("УровеньЦенаПродажи", РезультатЗапроса.УровеньЦенаПродажи);
		ОписаниеУровня.Вставить("УровеньКоличествоПродажи", РезультатЗапроса.УровеньКоличествоПродажи);	
		МассивСтрок.Добавить(ОписаниеУровня);
	КонецЦикла;
	Возврат  МассивСтрок;
КонецФункции 

&НаКлиенте
Процедура РаспределитьКоличествоПоУровням(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.КоличествоКРаспределению) Тогда
			Сообщить( НСтр("ru= 'Укажите ""Количество к распределению""'"));
			Возврат;
		КонецЕсли;
	КоличествоКРаспределению = Объект.КоличествоКРаспределению;
	Если КоличествоКРаспределению > 0 Тогда
		Для каждого ТекущаяСтрока Из Объект.Распределение Цикл
			КоличествоПокупкиПоУровню = ТекущаяСтрока.УровеньКоличествоПокупки;
			Если КоличествоКРаспределению >= КоличествоПокупкиПоУровню  Тогда
				ТекущаяСтрока.КоличествоПокупки = КоличествоПокупкиПоУровню;
				ТекущаяСтрока.КоличествоПродажи = ТекущаяСтрока.УровеньКоличествоПродажи;
				КоличествоКРаспределению = КоличествоКРаспределению - КоличествоПокупкиПоУровню;
			Иначе 
				ТекущаяСтрока.КоличествоПокупки = КоличествоКРаспределению;
				ТекущаяСтрока.КоличествоПродажи = КоличествоКРаспределению;
				КоличествоКРаспределению = КоличествоКРаспределению - КоличествоКРаспределению;
				
			КонецЕсли;
		КонецЦикла;	
		
	Иначе
		Сообщить( НСтр("ru='Укажите количество акций к распределению'"));
		Возврат;
	КонецЕсли;		
КонецПроцедуры
